/*  drivers/input/keyboard/synaptics_i2c_rmi.c *  * Copyright  (C) 2007  Google,
Inc. * * This software is licensed  under the terms of the GNU General  Public *
License version 2, as  published by the Free  Software Foundation, and *  may be
copied,  distributed,  and modified  under  those terms.  *  * This  program  is
distributed in  the hope  that it  will be  useful, *  but WITHOUT ANY WARRANTY;
without  even  the  implied  warranty of  *  MERCHANTABILITY  or  FITNESS FOR  A
PARTICULAR PURPOSE.  See the * GNU General Public License for more details. * */

#include <linux/module.h>
#include <linux/delay.h>
#include <linux/earlysuspend.h>
#include <linux/hrtimer.h>
#include <linux/i2c.h>
#include <linux/slab.h>
#include <linux/input.h>
#include <linux/interrupt.h>
#include <linux/io.h>
#include <linux/platform_device.h>
#include <linux/synaptics_i2c_rmi.h>
#include <mach/gpio.h>

#ifdef SYNAPTICS_FW_REFLASH
#include "synaptics_reflash.h"
#endif

#ifdef TOUCH_TEST
#include <linux/syscalls.h>
#include <linux/fcntl.h>
#include <linux/fs.h>
#include <linux/uaccess.h>

#include <linux/module.h>
#include <linux/input.h>
#include <linux/syscalls.h>
#include <linux/delay.h>

#endif

#ifdef SYNAPTICS_FW_REFLASH
#define FW_REFLASH_SUCCEED 0
#endif

#ifdef SYNAPTICS_TOUCH_LOG
#define SHOW_MSG(args...)	printk(KERN_INFO args)
#else
#define SHOW_MSG(args...)
#endif

 #ifdef SYNAPTICS_TOUCH_DEBUG
 #define DEBUG_MSG(args...)	printk(KERN_INFO args)
 #else
 #define DEBUG_MSG(args...)
 #endif

 #ifdef SYNAPTICS_TOUCH_ERR
#define ERR_MSG(args...)	printk(KERN_ERR args)
 #else
#define ERR_MSG(args...)
 #endif

#define SYNAPTICS_TS_POLLING_TIME 	1 /* polling time(msec) when touch was pressed */

#define INT_STATUS_REG				0x14

#define SYNAPTICS_INT_REG			0x26
#define SYNAPTICS_CONTROL_REG		0x25
#define REPORT_MODE_2D				0x27
#define MAX_X_POS_LOW_REG			0x2D
#define MAX_X_POS_HIGH_REG			0x2E
#define MAX_Y_POS_LOW_REG			0x2F
#define MAX_Y_POS_HIGH_REG			0x30

#define QUERY_BASE_REG				0xE3

#ifdef SYNAPTICS_MELTINGMODE
#define SYNAPTICS_MELTING_REG	0xF0
#endif

#define SYNAPTICS_INT_FLASH		1<<0
#define SYNAPTICS_INT_STATUS 	1<<1
#define SYNAPTICS_INT_ABS0 		1<<2

#define SYNAPTICS_CONTROL_SLEEP 	1<<0
#define SYNAPTICS_CONTROL_NOSLEEP	1<<2

#ifdef SYNAPTICS_MELTINGMODE
#define SYNAPTICS_MELTING_NO		0
#define SYNAPTICS_MELTING_MELT		1<<0
#define SYNAPTICS_MELTING_AUTO		1<<1
#endif

#define FINGER_MAX 2
#define START_ADDR      0x13
#define PRODUCT_ID_STRING_NUM	11
#define CMD_REG_BLOCK_NUM		41
/************************************/

int fw_rev = 0;
EXPORT_SYMBOL(fw_rev);
module_param(fw_rev, int, S_IWUSR | S_IRUGO);

/******* enum ***********************/
enum {
	SYNAPTICS_2000 = 0,
	SYNAPTICS_2100,
	SYNAPTICS_3000,
};
/************************************/

/***********************************************************/
/**************** structure ***********************************/
struct synaptics_ts_data {
	uint16_t addr;
	struct i2c_client *client;
	struct input_dev *input_dev;
	int use_irq;
	bool has_relative_report;
	struct hrtimer timer;
	struct work_struct  work;
#ifdef SYNAPTICS_FW_REFLASH
	struct work_struct  work_for_reflash;
#endif
	uint16_t max[2];
	int snap_state[2][2];
	int snap_down_on[2];
	int snap_down_off[2];
	int snap_up_on[2];
	int snap_up_off[2];
	int snap_down[2];
	int snap_up[2];
	uint32_t flags;
	int reported_finger_count;
	int8_t sensitivity_adjust;
	int (*power)(unsigned char on);
	struct early_suspend early_suspend;
	int fw_revision;
};

typedef struct									// synaptics 2000	// synaptics 2100
{
	unsigned char device_status_reg;            //0x13
	unsigned char interrupt_status_reg;			//0x14
	unsigned char finger_state_reg;				//0x15

	// Finger 0
	unsigned char X_high_position_finger0_reg;  //0x16
	unsigned char Y_high_position_finger0_reg;	//0x17
	unsigned char XY_low_position_finger0_reg;	//0x18
	unsigned char XY_width_finger0_reg;			//0x19
	unsigned char Z_finger0_reg;				//0x1A
	// Finger 1
	unsigned char X_high_position_finger1_reg;  //0x1B
	unsigned char Y_high_position_finger1_reg;	//0x1C
	unsigned char XY_low_position_finger1_reg;	//0x1D
	unsigned char XY_width_finger1_reg;			//0x1E
	unsigned char Z_finger1_reg;				//0x1F
 } ts_sensor_data;

typedef struct 									// synaptics 2000 // 2100 //3000
{
	unsigned char device_command;				//0x58			  //0x5C  //0x70
	unsigned char command_2d;					//0x59			  //0x5D  //0x71
	unsigned char bootloader_id0;				//0x5A			  //0x5E  //0x72
	unsigned char bootloader_id1;				//0x5B			  //0x5F  //0x73
	unsigned char flash_properties;				//0x5C			  //0x60  //0x74
	unsigned char block_size0;					//0x5D			  //0x61  //0x75
	unsigned char block_size1;					//0x5E			  //0x62  //0x76
	unsigned char firmware_block_cnt0;			//0x5F			  //0x63  //0x77
	unsigned char firmware_block_cnt1;			//0x60			  //0x64  //0x78
	unsigned char config_block_cnt0;			//0x61			  //0x65  //0x79
	unsigned char config_block_cnt1;			//0x62			  //0x66  //0x7A
	unsigned char manufact_id_query;			//0x63			  //0x67  //0x7B
	unsigned char product_properties_query;		//0x64			  //0x68  //0x7C
	unsigned char customer_family_query;		//0x65			  //0x69  //0x7D
	unsigned char firmware_revision_query;		//0x66			  //0x6A  //0x7E
	unsigned char device_serialization_query0;	//0x67			  //0x6B  //0x7F
	unsigned char device_serialization_query1;	//0x68			  //0x6C  //0x80
	unsigned char device_serialization_query2;	//0x69			  //0x6D  //0x81
	unsigned char device_serialization_query3;	//0x6A			  //0x6E  //0x82
	unsigned char device_serialization_query4;	//0x6B			  //0x6F  //0x83
	unsigned char device_serialization_query5;	//0x6C			  //0x70  //0x84
	unsigned char device_serialization_query6;	//0x6D			  //0x71  //0x85
	unsigned char product_id_query0;			//0x6E			  //0x72  //0x86
	unsigned char product_id_query1;			//0x6F			  //0x73  //0x87
	unsigned char product_id_query2;			//0x70			  //0x74  //0x88
	unsigned char product_id_query3;			//0x71			  //0x75  //0x89
	unsigned char product_id_query4;			//0x72			  //0x76  //0x8A
	unsigned char product_id_query5;			//0x73			  //0x77  //0x8B
	unsigned char product_id_query6;			//0x74			  //0x78  //0x8C
	unsigned char product_id_query7;			//0x75			  //0x79  //0x8D
	unsigned char product_id_query8;			//0x76			  //0x7A  //0x8E
	unsigned char product_id_query9;			//0x77			  //0x7B  //0x8F
	unsigned char per_device_query;				//0x78			  //0x7C  //0x90
	unsigned char reporting_mode_2d;			//0x79			  //0x7D  //0x91
	unsigned char number_x_electrode_2d;		//0x7A			  //0x7E  //0x92
	unsigned char number_y_electrode_2d;		//0x7B			  //0x7F  //0x93
	unsigned char maximum_electorde_2d;			//0x7C			  //0x80  //0x94
	unsigned char absolute_query_2d;			//0x7D			  //0x81  //0x95
}ts_sensor_command;

typedef struct {
	unsigned char finger_count;
	int X_position[FINGER_MAX];
	int Y_position[FINGER_MAX];
} ts_finger_data;
/***********************************************************/

/***********************************************************************************/
/*********** MACROS ****************************************************************/
// 0x00 - not present, 0x01 - present & accurate, 0x10 - present but not accurate, 0x11 - Reserved
#define TS_SNTS_GET_FINGER_STATE_0(finger_status_reg) \
		(finger_status_reg&0x03)
#define TS_SNTS_GET_FINGER_STATE_1(finger_status_reg) \
		((finger_status_reg&0x0C)>>2)
#define TS_SNTS_GET_FINGER_STATE_2(finger_status_reg) \
		((finger_status_reg&0x30)>>4)
#define TS_SNTS_GET_FINGER_STATE_3(finger_status_reg) \
      ((finger_status_reg&0xC0)>>6)
#define TS_SNTS_GET_FINGER_STATE_4(finger_status_reg) \
      (finger_status_reg&0x03)

